var weeklies = {
    "challenge-rifts": {
        task: "Портал дерзаний",
        url: "#",
        desc: "Поднимитесь как можно выше в портале дерзаний, чтобы получить еженедельные награды",
        img: "placeholder",
        boxcount: 1
    },
    "codex-quest": {
        task: "Квесты Кодекса",
        url: "#",
        desc: "Выполнение квестов кодексов боевого пропуска",
        img: "placeholder",
        boxcount: 1
    },
    "contract": {
        task: "Еженедельнве Контракты",
        url: "#",
        desc: "Выполните 3 контракта, чтобы получить еженедельные награды",
        img: "placeholder",
        boxcount: 3
    },
    "fading-ember": {
        task: "Мерцающий уголь",
        url: "#",
        desc: "Выполните Древние порталы, чтобы собрать 320 {ember}",
        img: "ember",
        boxcount: 1
    },
    "helliquary": {
        task: "Адский реликварий",
        url: "#",
        desc: "Убейте ВСЕХ боссов Адского реликвария, которых сможете. Сбрасывается каждый понедельник и четверг",
        img: "scoria",
        boxcount: 1
    },
    "hilt": {
        task: "Еженедельный собиратель эфисов ",
        url: "#",
        desc: "Покупайте еженедельные товары у собирателя эфисов",
        img: "hilts",
        boxcount: 1
    },
    "vault": {
        task: "Ограбление Сокровищницы",
        time: "12-19",
        duration: 2,
        url: "#",
        desc: "Выполняйте задания в Сокровищнице до получения максимального вознаграждения",
        img: "gold",
        boxcount: 1
    },
};